### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.test_secret must be replaced
-/+ resource "github_actions_secret" "test_secret" {
!       created_at      = "2021-10-11 01:52:43 +0000 UTC" -> (known after apply)
!       id              = "github-settings:BY_TERRAFORM" -> (known after apply)
-       plaintext_value = (sensitive value) # forces replacement
!       secret_name     = "BY_TERRAFORM" -> "TEST_SECRET" # forces replacement
!       updated_at      = "2021-10-11 01:52:43 +0000 UTC" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>